Revit 2017 API
RevitLinkLoadResult Methods
The RevitLinkLoadResult type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCentralModelName
 Gets the central model's name. If the link is not workshared, this returns an empty FilePath. If the link is itself a central model, this returns the link's name.
GetExternalResourceReference
 Gets a copy of the ExternalResourceReference corresponding to the link.
GetExternalResourceReferencesFromFailedLoads
 Searches this and all nested LinkLoadResults, and returns a list of ExternalResourceReferences for the links that failed to load.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLinkLoadResult
 Searches this LinkLoadResult and all nested LinkLoadResults for the load operation results of a specified ExternalResourceReference.
GetModelName
 Gets the name of the model.
GetNestedLinkLoadResults
 Gets the results for this link's nested links.
GetParentModelName
 Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCodeSuccess
 Check if load result code signifies success.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RevitLinkLoadResult Class
Autodesk.Revit.DB Namespace